---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSet.Insert(Autodesk.Revit.DB.Visual.Asset)
source: html/2f362523-5fa1-fa99-cd88-fb3cf70a3602.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.Insert Method

## Syntax (C#)
```csharp
public virtual bool Insert(
	Asset item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Visual.Asset`)